[
  {
     "challenge":"Mary the Mother of God",
     "quotes": ["Elizabeth calls mary the mother of my lord - Luke 1:43", "Behold a virgin shall conceive and bear a son and his name shall be called Emmanuel (which means God with us) - Matthew 1:23", "But when the time had fully come, God sent forth his Son, born of woman - Galatians 4:4", "But when the time had fully come God sent forth his Son, born of woman, The Holy Spirit will come upon you and the power of the Most High will overshadow you; therefore the child to be born will be called holy, the Son of God - Luke 1:35"],
     "picture": "marymotherofgod.jpg",
     "link": "https://www.catholic.com/magazine/print-edition/how-can-mary-be-gods-mother"
 },
 
  {
    "challenge":"The Immaculate Conception",
    "quotes":["“Blessed are you among women, and blessed is the fruit of your womb! And why is this granted me, that the mother of my Lord should come to me? - Luke 1:42-43", "The above verse is parallel to 2 Samuel where David says '“How can the ark of the LORD come to me?”' - 2 Samuel 6:9", "Elizabeth says Mary is blessed are you among women - Luke 1:42", "Gabriel greets Mary by saying 'Hail, full of grace' - Luke 1:28"],
    "picture": "maryuniqueperson.jpg",
    "link": "https://www.catholic.com/magazine/online-edition/the-immaculate-conception-in-scripture"
   },
   {
     "challenge": "Perpetual Virginity of Mary",
     "quotes": ["When asked to give birth to Jesus, Mary responds 'How can this be , since I do not know man' - Luke 1:34", "When on the cross, Jesus leaves Mary to John and not another sibling - John 19:26"],
     "picture": "perpetualvirginity.jpg",
     "link": "https://www.catholic.com/tract/mary-ever-virgin"
   },
   {
     "challenge":"Calling priests father",
     "quotes":["Paul calls himself father of the corinthians - 1 Corinthians 4:14-15", "Stephen calls Jewish council members fathers - Acts 7:2", "Paul addresses Jews as fathers - Acts 22:1", "Paul calls himself father of Ones'imus - Philemon 1:10"],
     "picture": "callpriestfather.jpg",
     "link": "https://www.catholic.com/tract/call-no-man-father"
   },
 
   {
     "challenge":"Purgatory",
     "quotes":["Nothing unclean will enter heaven - Revelation 21:27", "Sins againt the holy spirit will not be forgiven in this age or the age to come - Matthew 12:32","David is still punished for sin even though he is forgiven by God - 2 Samuel 12:13-14", "If any man’s work is burned up, he will suffer loss, though he himself will be saved, but only as through fire - 1 Corinthians 3:15", "Jesus preaches to 'spirits in prison' - 1 Peter 3:18-20"],
     "picture": "purgatory.jpg",
     "link": "https://www.catholic.com/magazine/online-edition/is-purgatory-in-the-bible"
   },
   
   {
     "challenge": "Praying to and veneration of the Saints",
     "quotes": ["Prayers of saints are offered to God by an angel - Revelation 5:8", "Joshua 'fell on his face to the earth' before an Angel - Joshua 5:14", "Jesus talks to Elijah and Moses - Mark 9:4", "Daniel falls prostrate before Gabriel - Daniel 8:17", "The Saints are shown alive in Heaven worshiping God - Revelation 4:10", "The Saints are shown alive and praying for the avenging of their martyrdom - Revelation 6:9-11", "The prayer of a righteous man has great power in its effects - James 5:16"],
     "picture": "saints.jpg",
     "link": "https://www.catholic.com/magazine/print-edition/the-bible-supports-praying-to-the-saints"
   },
   
   {
     "challenge":"Real Presence in the Eucharist",
     "quotes": ["The Jews then disputed among themselves, saying, “How can this man give us his flesh to eat?” So Jesus said to them, “Truly, truly, I say to you, unless you eat the flesh of the Son of man and drink his blood, you have no life in you; he who eats my flesh and drinks my blood has eternal life, and I will raise him up at the last day. For my flesh is food indeed, and my blood is drink indeed. He who eats my flesh and drinks my blood abides in me, and I in him. As the living Father sent me, and I live because of the Father, so he who eats me will live because of me. This is the bread which came down from heaven, not such as the fathers ate and died; he who eats this bread will live for ever.” - John 6:52-58", "After the above passage, many discples take Jesus literally and say 'This is a hard saying; who can listen to it?' and instead of correcting them Jesus responds saying 'Do you take offense at this? Then what if you were to see the Son of man ascending where he was before?' - John 6:60-62", "Whoever, therefore, eats the bread or drinks the cup of the Lord in an unworthy manner will be guilty of profaning the body and blood of the Lord. Let a man examine himself, and so eat of the bread and drink of the cup. For any one who eats and drinks without discerning the body eats and drinks judgment upon himself - 1 Corinthians 12:27-29"],
     "picture": "eucharist.jpg",
     "link": "https://www.catholic.com/tract/the-real-presence"
   },
 
   {
     "challenge":"Confession",
     "quotes":["If you forgive the sins of any, they are forgiven; if you retain the sins of any, they are retained.” - John 20:23", "Therefore confess your sins to one another, and pray for one another, that you may be healed - James 5:16", "All this is from God, who through Christ reconciled us to himself and gave us the ministry of reconciliation - 2 Corinthians 5:18", "Truly, I say to you, whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven - Matthew 18:18", "Prayer of the church elders forgives sins - James 5:13-15"],
     "picture": "confession.jpg",
     "link": "https://www.catholic.com/magazine/online-edition/is-confession-in-scripture"
   },
 
   {
     "challenge":"You can loose your salvation",
     "quotes":["“Not every one who says to me, ‘Lord, Lord,’ shall enter the kingdom of heaven, but he who does the will of my Father who is in heaven. On that day many will say to me, ‘Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many mighty works in your name?’ And then will I declare to them, ‘I never knew you; depart from me, you evildoers.' - Matthew 7:21-23", "But he who endures to the end will be saved - Matthew 24:13", "Note then the kindness and the severity of God: severity toward those who have fallen, but God’s kindness to you, provided you continue in his kindness; otherwise you too will be cut off - Romans 11:22", "Therefore, my beloved, as you have always obeyed, so now, not only as in my presence but much more in my absence, work out your own salvation with fear and trembling; for God is at work in you, both to will and to work for his good pleasure - Philippians 2:12-13", "Therefore let any one who thinks that he stands take heed lest he fall - 1 Corinthians 10:12", "You are severed from Christ, you who would be justified by the law; you have fallen away from grace - Galatians 5:4", "if we endure, we shall also reign with him; if we deny him, he also will deny us - 2 Timothy 2:12", "For if we sin deliberately after receiving the knowledge of the truth, there no longer remains a sacrifice for sins, but a fearful prospect of judgment, and a fury of fire which will consume the adversaries - Hebrews 10:26-27"],
     "picture": "loosesalvation.jpg",
     "link": "https://www.catholic.com/magazine/online-edition/can-salvation-be-lost"
   },
 
   {
     "challenge":"Bible plus Tradition",
     "quotes": ["I commend you because you remember me in everything and maintain the traditions even as I have delivered them to you - 1 Corinthians 11:2", "So then, brethren, stand firm and hold to the traditions which you were taught by us, either by word of mouth or by letter - 2 Thessalonians 2:15", "Now we command you, brethren, in the name of our Lord Jesus Christ, that you keep away from any brother who is walking in idleness and not in accord with the tradition that you received from us - 2 Thessalonians 3:6", "John says there are many things Jesus said and did that are not written - John 21:25", "First of all you must understand this, that no prophecy of Scripture is a matter of one’s own interpretation - 2 Peter 1:20"],
     "picture": "bibletradition.jpg",
     "link": "https://www.catholic.com/magazine/print-edition/sacred-scripture-depends-on-sacred-tradition"
   },
 
   {
     "challenge":"Infant Baptism",
     "quotes": ["Jesus answered, “Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God - John 3:5", "For as in Adam all die, so also in Christ shall all be made alive - 1 Corinthians 15:22", "Baptism replaced circumcision - Colossians 2:11-12", "Paul tells a man 'Believe in the Lord Jesus, and you will be saved, you and your household' then baptizes him and his whole household - Acts 16:28-34"],
     "picture": "infantbaptism.jpg",
     "link": "https://www.catholic.com/magazine/online-edition/infant-baptism"
   },
 
   {
       "challenge": "Good works do matter",
       "quotes": ["For in Christ Jesus neither circumcision nor uncircumcision is of any avail, but faith working through love - Galatians 5:6", "For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand, that we should walk in them - Ephesians 2:10", "For he will render to every man according to his works: to those who by patience in well-doing seek for glory and honor and immortality, he will give eternal life - Romans 2:6-7", "What does it profit, my brethren, if a man says he has faith but has not works? Can his faith save him? If a brother or sister is poorly clothed and in lack of daily food, and one of you says to them, “Go in peace, be warmed and filled,” without giving them the things needed for the body, what does it profit? So faith by itself, if it has no works, is dead - James 2:14-17", "Therefore, my beloved, as you have always obeyed, so now, not only as in my presence but much more in my absence, work out your own salvation with fear and trembling; for God is at work in you, both to will and to work for his good pleasure - Phillipians 2:12-13"],
       "picture": "poor.jpg",
       "link": "https://www.catholic.com/magazine/online-edition/are-good-works-necessary-for-salvation"
   },
 
   {
     "challenge":"The use of relics",
     "quotes": ["People are cured by face cloths touched by Paul - Acts 19:11-12", "Cures are performed through Peter's shadow - Acts 5:15-16", "Contact with the bones of Elisha revives a man - 2 Kings 13:20-21"],
     "picture": "relic.jpg",
     "link": "https://www.catholic.com/qa/is-veneration-of-relics-condemned-by-the-bible"
   },
  
   {
    "challenge":"The use of statues",
    "quotes": ["God commands the Israelites to make two cherubim of gold and to put them on the ark - Exodus 25:18-21", "God tells Moses to make a serpent and set it up as a sign - Numbers 21:8", "Solomon makes cheribum statues - 1 Kings 6:23-28", "Solomon orders various carvings and statues built - 1 Kings 7:23-39"],
    "picture": "statues.jpg",
    "link": "https://www.catholic.com/qa/how-can-the-church-allow-statues-when-exodus-20-forbids-it"
   },

   {
    "challenge":"The papacy and the primacy of peter",
    "quotes": ["And I tell you, you are Peter, and on this rock I will build my Church, and the gates of Hades shall not prevail against it. I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven - Matthew 16:18-19","The above verse is a parallel to Isaiah 22 where Eliakim is given authority over Israel - Isaiah 22:20-22", "Peter is always listed first when scripture lists all of the apostles - Matthew 10:2-4, Mark 3:14-19", "Jesus tells Peter: “Simon, Simon, behold, Satan demanded to have you, that he might sift youk like wheat, but I have prayed for you that your faith may not fail; and when you have turned again, strengthen your brethren - Luke 22:31-32", "Jesus empoweres Peter to walk on water - Matthew 14:22-33", "Peter settles the debate at the council of Jerusalem and after his declaration 'all of the assembly kept silence' - Acts 15:1-12" ],
    "picture": "st peter.jpg",
    "link": "https://www.catholic.com/magazine/online-edition/the-papacy-in-scripture-no-rocks-required"
   },

   {
    "challenge":"Apostolic Succession",
    "quotes": ["After Jesus ascends, the Apostles choose a replacement for Judas - Acts 1:21-26", "You then, my son, be strong in the grace that is in Christ Jesus, and what you have heard from me before many witnesses entrust to faithful men who will be able to teach others also - 2 Timothy 2:1-2", "The saying is sure: If any one aspires to the office of bishop, he desires a noble task. Now a bishop must be above reproach, the husband of one wife, temperate, sensible, dignified, hospitable, an apt teacher, no drunkard, not violent but gentle, not quarrelsome, and no lover of money - 1 Timothy 3:1-3", "This is why I left you in Crete, that you might amend what was defective, and appoint elders in every town as I directed you - Titus 1:5"],
    "picture": "bishop.jpg",
    "link": "https://www.catholic.com/video/apostolic-succession-in-the-bible"
   },

   {
    "challenge":"Different Levels of Sin",
    "quotes": ["If any one sees his brother committing what is not a deadly sin, he will ask, and God will give him life for those whose sin is not deadly. There is sin which is deadly; I do not say that one is to pray for that. All wrongdoing is sin, but there is sin which is not deadly - 1 John 5:16-18"],
    "picture": "justice.jpg",
    "link": "https://www.catholic.com/magazine/online-edition/mortal-and-venial-sin"
   },

   {
    "challenge":"Scandal in the Church",
    "quotes": ["Jesus tells his followers to obey the pharisees even though they dont practice what they preach - Matthew 23:2-3","Judas Iscariot betrays Jesus for money - Matthew 26:14-16","Jesus was aware of Judas's future and still appointed him as an Apostle - John 6:70-71", "Peter refused to eat with Gentiles in front of Jewish converts - Galatians 2:11-13"],
    "picture": "news.jpg",
    "link": "https://www.catholic.com/magazine/print-edition/scandals-nothing-new-under-the-sun"
   },

   {
    "challenge":"Repetitive Prayer",
    "quotes": ["Jesus says the same prayer three times in a row in Gethsemane - Matthew 26:36-44", "And the four living creatures, each of them with six wings, are full of eyes all round and within, and day and night they never cease to sing, “Holy, holy, holy, is the Lord God Almighty, who was and is and is to come!” - Revelation 4:8"],
    "picture": "rosary.jpg",
    "link":"https://www.catholic.com/magazine/online-edition/its-not-vain-to-repeat-your-prayers"
   }, 

   {
    "challenge":"There must be one church",
    "quotes": ["The glory which you have given me I have given to them, that they may be one even as we are one, I in them and you in me, that they may become perfectly one, so that the world may know that you have sent me and have loved them even as you have loved me - John 17: 22-23", "So if there is any encouragement in Christ, any incentive of love, any participation in the Spirit, any affection and sympathy, complete my joy by being of the same mind, having the same love, being in full accord and of one mind - Phillipians 2:1-2","There is one body and one Spirit, just as you were called to the one hope that belongs to your call, 5one Lord, one faith, one baptism, 6one God and Father of us all, who is above all and through all and in all - Ephesians 4:4-6", "I appeal to you, brethren, to take note of those who create dissensions and difficulties, in opposition to the doctrine which you have been taught; avoid them - Romans 16:17", "And I have other sheep, that are not of this fold; I must bring them also, and they will heed my voice. So there shall be one flock, one shepherd - John 10:16"],
    "picture": "rome.jpg",
    "link": "https://www.catholic.com/magazine/print-edition/how-do-we-know-its-the-true-church"
   },

   {
    "challenge": "Original Sin",
    "quotes": ["Therefore as sin came into the world through one man and death through sin, and so death spread to all men because all men sinned sin indeed was in the world before the law was given, but sin is not counted where there is no law. Yet death reigned from Adam to Moses, even over those whose sins were not like the transgression of Adam, who was a type of the one who was to come. But the free gift is not like the trespass. For if many died through one man’s trespass, much more have the grace of God and the free gift in the grace of that one man Jesus Christ abounded for many. And the free gift is not like the effect of that one man’s sin. For the judgment following one trespass brought condemnation, but the free gift following many trespasses brings justification. If, because of one man’s trespass, death reigned through that one man, much more will those who receive the abundance of grace and the free gift of righteousness reign in life through the one man Jesus Christ. Then as one man’s trespass led to condemnation for all men, so one man’s act of righteousness leads to acquittal and life for all men. For as by one man’s disobedience many were made sinners, so by one man’s obedience many will be made righteous - Romans 5:12-19", "For as by a man came death, by a man has come also the resurrection of the dead. For as in Adam all die, so also in Christ shall all be made alive - 1 Corinthians 15:21-22 "],
    "picture": "apple.jpg",
    "link": "https://www.catholic.com/magazine/online-edition/original-sin-blame-your-dad"
   }
 
 ]